In [3]:
import pandas as pd
import numpy as np

In [ ]:
# Write a Python program to create and display a onedimensional
# array-like object containing an array of data using
# Pandas module.
ps = pd.Series(np.arange(10,25))
ps

In [ ]:
pdseries = pd.Series([1,2,3,4,5],index = list('abcde'))
pdseries
pdseries.tolist()

In [ ]:
# Write a Python program to add, subtract, multiple and divide
# two Pandas Series.

a=pd.Series([1,2,3,4],index = ['a','b','c','d'])
b=pd.Series([1,2],index = ['a','b'])
a.add(b,fill_value = 0) 
a.sub(b,fill_value = 0) 
a.mul(b,fill_value = 1) 
a.div(b,fill_value = 1)

In [ ]:
# Write a Python program to compare the elements of the two
# Pandas Series.
ser1=pd.Series([1,3,4,5])
ser2=pd.Series([2,3,4,5])
print(ser1==ser2)
print(ser1>ser2)
print(ser1<ser2)

In [ ]:
# Write a Python program to display the following data column
# wise.

In [ ]:
# Write a Python program to create and display a Data Frame
# from a specified dictionary data which has the index labels.

d={'a':10,'b':20,'c':30}
pd.DataFrame(d,index =['i1'])

In [4]:
# Write a Python program to select the specified columns and
# rows from a given Data Frame.

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James',
'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no',
'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(exam_data,index = labels)
df
df['name']#selecting column name
df.loc['a']#selecting row with index a

name        Anastasia
score            12.5
attempts            1
qualify           yes
Name: a, dtype: object

In [ ]:
# Write a Python program to select the rows the score is between
# 15 and 20 (inclusive).
df
df[(df['score']>=15) & (df['score']<=20)]

In [ ]:
# Write a Python program to select the rows where number of
# attempts in the examination is less than 2 and score greater than
# 15.
df[(df['attempts']<2) & (df['score']>15)]

In [ ]:
# Write a Python program to append a new row 'k' to Data Frame
# with given values for each column. Now delete the new row and
# return the original data frame.
new_row = ['New row',20,30,'yes']
df.loc['k'] = new_row
df

In [ ]:
# Write a Python program to sort the data frame first by 'name' in
# descending order, then by 'score' in ascending order.

sorteddf=df.sort_values(by=['name', 'score'], ascending=[False, True])
sorteddf

In [5]:
# Write a Python program to insert a new column in existing Data
# Frame.
#Add new column 'Year'
new_coluname = 'year'
df[new_coluname]= '2010'
df

        name  score  attempts qualify  year
a  Anastasia   12.5         1     yes  2010
b       Dima    9.0         3      no  2010
c  Katherine   16.5         2     yes  2010
d      James    NaN         3      no  2010
e      Emily    9.0         2      no  2010
f    Michael   20.0         3     yes  2010
g    Matthew   14.5         1     yes  2010
h      Laura    NaN         1      no  2010
i      Kevin    8.0         2      no  2010
j      Jonas   19.0         1     yes  2010

In [7]:
# Write a Python program to change the name 'James' to 'Suresh'
# in name column of the data frame.
df['name'] = df['name'].replace('James', 'Suresh')
df

        name  score  attempts qualify  year
a  Anastasia   12.5         1     yes  2010
b       Dima    9.0         3      no  2010
c  Katherine   16.5         2     yes  2010
d     Suresh    NaN         3      no  2010
e      Emily    9.0         2      no  2010
f    Michael   20.0         3     yes  2010
g    Matthew   14.5         1     yes  2010
h      Laura    NaN         1      no  2010
i      Kevin    8.0         2      no  2010
j      Jonas   19.0         1     yes  2010